model {
  ssd {
    num_classes: 3
    image_resizer {
      fixed_shape_resizer {
        height: 640
        width: 640
      }
    }
    feature_extractor {
      type: "ssd_resnet50_v1_fpn_keras"
      depth_multiplier: 1.0
      min_depth: 16
      conv_hyperparams {
        regularizer {
          l2_regularizer {
            weight: 0.0004
          }
        }
        initializer {
          truncated_normal_initializer {
            mean: 0.0
            stddev: 0.03
          }
        }
        activation: RELU_6
        batch_norm {
          decay: 0.997
          scale: true
          epsilon: 0.001
        }
      }
      override_base_feature_extractor_hyperparams: true
      fpn {
        min_level: 3
        max_level: 7
      }
    }
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
        use_matmul_gather: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    box_predictor {
      weight_shared_convolutional_box_predictor {
        conv_hyperparams {
          regularizer {
            l2_regularizer {
              weight: 0.0004
            }
          }
          initializer {
            random_normal_initializer {
              mean: 0.0
              stddev: 0.01
            }
          }
          activation: RELU_6
          batch_norm {
            decay: 0.997
            scale: true
            epsilon: 0.001
          }
        }
        depth: 256
        num_layers_before_predictor: 4
        kernel_size: 3
        class_prediction_bias_init: -4.6
      }
    }
    anchor_generator {
      multiscale_anchor_generator {
        min_level: 3
        max_level: 7
        anchor_scale: 4.0
        aspect_ratios: 1.0
        aspect_ratios: 2.0
        aspect_ratios: 0.5
        scales_per_octave: 2
      }
    }
    post_processing {
      batch_non_max_suppression {
        score_threshold: 1e-08
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 100
        use_static_shapes: false
      }
      score_converter: SIGMOID
    }
    normalize_loss_by_num_matches: true
    loss {
      localization_loss {
        weighted_smooth_l1 {
        }
      }
      classification_loss {
        weighted_sigmoid_focal {
          gamma: 2.0
          alpha: 0.25
        }
      }
      classification_weight: 1.0
      localization_weight: 1.0
    }
    encode_background_as_zeros: true
    normalize_loc_loss_by_codesize: true
    inplace_batchnorm_update: true
    freeze_batchnorm: false
  }
}
train_config {
  batch_size: 1
  
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  data_augmentation_options {
    random_rgb_to_gray {
      probability: 0.1
    }
  }
  data_augmentation_options {
    random_adjust_brightness {
      max_delta: 0.3
    }
  }
  data_augmentation_options {
    random_adjust_contrast {
      max_delta: 1.25
    }
  }
  data_augmentation_options {
    random_adjust_saturation {
      min_delta: 0.5
      max_delta: 2
    }
  }
  data_augmentation_options {
    random_adjust_hue {
    }
  }
  data_augmentation_options {
    random_crop_image {
      min_object_covered: 0.0
      min_aspect_ratio: 0.75
      max_aspect_ratio: 3.0
      min_area: 0.75
      max_area: 1.0
      overlap_thresh: 0.0
    }
  }
  data_augmentation_options {
    random_black_patches {
      max_black_patches: 4
      probability: 0.2
      size_to_image_ratio: 0.1
    }
  }
  sync_replicas: true
  optimizer {
    momentum_optimizer {
      learning_rate {
        cosine_decay_learning_rate {
          learning_rate_base: 0.04
          total_steps: 25000
          warmup_learning_rate: 0.013333
          warmup_steps: 2000
        }
      }
      momentum_optimizer_value: 0.9
    }
    use_moving_average: false
  }
  fine_tune_checkpoint: "pretrained_models/ssd_resnet50_v1_fpn_640x640_coco17_tpu-8/checkpoint/ckpt-0"
  num_steps: 25000
  startup_delay_steps: 0.0
  replicas_to_aggregate: 8
  max_number_of_boxes: 100
  unpad_groundtruth_tensors: false
  fine_tune_checkpoint_type: "detection"
  use_bfloat16: false
  fine_tune_checkpoint_version: V2
}
train_input_reader {
  label_map_path: "experiments/label_map.pbtxt"
  tf_record_input_reader {

    input_path: "data/train/segment-11847506886204460250_1640_000_1660_000_with_camera_labels.tfrecord"
  }
}
eval_config {
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
}
eval_input_reader {
  label_map_path: "experiments/label_map.pbtxt"
  shuffle: false
  num_epochs: 1
  tf_record_input_reader {
    input_path: "data/val/segment-11588853832866011756_2184_462_2204_462_with_camera_labels.tfrecord"
    input_path: "data/val/segment-1022527355599519580_4866_960_4886_960_with_camera_labels.tfrecord"
    input_path: "data/val/segment-10498013744573185290_1240_000_1260_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-10517728057304349900_3360_000_3380_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-11967272535264406807_580_000_600_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-11489533038039664633_4820_000_4840_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-10275144660749673822_5755_561_5775_561_with_camera_labels.tfrecord"
    input_path: "data/val/segment-10082223140073588526_6140_000_6160_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-10927752430968246422_4940_000_4960_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-10786629299947667143_3440_000_3460_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-11486225968269855324_92_000_112_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-11388947676680954806_5427_320_5447_320_with_camera_labels.tfrecord"
    input_path: "data/val/segment-10599748131695282446_1380_000_1400_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-11139647661584646830_5470_000_5490_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-10963653239323173269_1924_000_1944_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-11454085070345530663_1905_000_1925_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-11940460932056521663_1760_000_1780_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-10072140764565668044_4060_000_4080_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-11355519273066561009_5323_000_5343_000_with_camera_labels.tfrecord"
  }
}
